import React from 'react';
import "./Chauvihar.css"
const Chauvihar = () => {
  return (
    <div>
     <h1 style={{textAlign:'center'}}>Chauvihar Chhath kari Giriraj 7 Yatra</h1>
      <div className="video-container">
        <iframe
          width="100%"
          height="500"
          src="https://www.youtube.com/embed/-5XDTXO4uXE"
          title="YouTube video player"
          frameBorder="0"
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
          allowFullScreen
        ></iframe>
      </div>
      
      

      {/* New content section */}
      <div style={{ color: 'black', padding: '20px', borderRadius: '5px' }}>
        <p>
        <span className="unique-text">પરમ પવન શ્રી સિદ્ધાચલ ગીરીરાજ ચોવિહાર છઠ સહિત ભવ ભ્રમણ ભાંગતી સાત યાત્રા... </span>તપ અને ત્યાગની સાધનામાં આત્મા પર લાગેલા ચીકણા કર્મો પણ બળીને ખાખ થઈ જાય છે એટલે કે નિર્જરા થવા દ્વારા આત્મા હળવો ફૂલ જેવો બની જાય છે. 
          <span className="unique-text">આત્માનું સર્વોત્તમ લક્ષ એટલે કે મોક્ષ - શાશ્વત સુખની પ્રાપ્તિ કરવી....</span>
          બીજા શબ્દોમાં સમજીએ તો પ્રત્યેક આસ્થામાં સુખ તો  પડેલું જ હોય છે તે માત્ર એના પર કર્મના આવરણો લાગી જવાના કારણે આત્મા બહુ ભ્રમણની ઝંઝાળમાં મોહ અને માયાના બંધનમાં બંધાઈ જાય છે અને દુઃખી દુઃખી થાય છે. 
          <span className="unique-text">આત્મ સ્વભાવમાં સ્થિર થવાની સાધનાના વિતરાગ પ્રભુએ અનેક માર્ગો ફરમાવ્યા છે અને સાધક આત્મા ગુરુ શરણથી સાધના પથ પર પ્રયત્નશીલ છે.</span>
          અઈમુતા કેવલી ભગવંતે ફરમાવેલ શાશ્વત સુખ ઝટપટ પ્રાપ્ત કરાવતી સર્વોત્તમ નિશ્ચિત સાધના એટલે || છટઠેણં ભત્તેણં, અપ્પાણેણં તું સત્ત જત્તાઈ,
          જો કુણ સેતુંજે,તઇયભવે લહઈ સો મુકખં ||
          // ચૌવિહાર છઠ સહિત શ્રી સિદ્ધાચલ ગિરિરાજ ની ભવ ભ્રમણના બંધનથી મુક્ત કરતી સાત યાત્રા // 
          આવો....જીવનને સરળ કરી મનને નિર્મળ કરી અમે કાયાને અને કાયાને તપથી परिणત કરી જીવનને ઉજવળ કરીએ.
          સૌ ચાલો સિદ્ધગીરી જઈએ, ગીરી ભેટી પાવન થઈએ, સોરઠ દેશે યાત્રાનુ રૂડું ધામ છે.....
          || આતમ જાગે... દોષો ભાગે...|| જીવનમાં કોઈપણ શુભ કાર્યની શરૂઆત થતા પૂર્વે પ્રભુની અનહદ કૃપા વરસે ત્યારે શુભ વિચાર પ્રગટે છે અને તે શુભ વિચારને આચારમાં લાવતા પૂર્વે શુભ સંકલ્પથી સંકલ્પ યાત્રા ની શરૂઆત થાય છે. મનમાં કોઈ અંતરિયાળ કોણે પ્રગટેલો સંકલ્પનો દીવડો બુઝી ના જાય તે માટે જતન યાત્રા એટલે કે દોષોથી નિર્મળ થવા માટેના ભાવોને વધુ મજબૂત કરવા વ્યક્તિ દેવ-ગુરુનું શરણુ સ્વીકારી નિકટના ઉપકારી માતા-પિતા અને સ્નેહીજનોને મળી આશીર્વાદ મેળવી શુભ સંકલ્પના પ્રગટેલા દિવડા નું શુભ परिणીત દ્વારા જતન કરતાં કરતાં સાત યાત્રા સુધી પહોંચે છે....
          " ગિરિવર દરીશન વિરલા પાવે.... પુરવ સંચિત કર્મ ખપાવે.....
        </p>
      </div>
      {/* End of new content section */}
    </div>
  );
};

export default Chauvihar;
